results/mpi_benchmark/sysbench_fio/fio_local/oc_sys-fio_local.worker06_1threads.2/stdout
sysbench 1.0.17 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     9539.90
    fsyncs/s:                     12212.47

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               149.06

General statistics:
    total time:                          10.0094s
    total number of events:              217626

Latency (ms):
         min:                                    0.00
         avg:                                    0.05
         max:                                    2.90
         95th percentile:                        0.15
         sum:                                 9947.79

Threads fairness:
    events (avg/stddev):           217626.0000/0.00
    execution time (avg/stddev):   9.9478/0.00

sysbench 1.0.17 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random read test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      487924.72
    writes/s:                     0.00
    fsyncs/s:                     0.00

Throughput:
    read, MiB/s:                  7623.82
    written, MiB/s:               0.00

General statistics:
    total time:                          10.0001s
    total number of events:              4879853

Latency (ms):
         min:                                    0.00
         avg:                                    0.00
         max:                                    0.07
         95th percentile:                        0.00
         sum:                                 9277.86

Threads fairness:
    events (avg/stddev):           4879853.0000/0.00
    execution time (avg/stddev):   9.2779/0.00

DONE